In [2]:
import pandas as pd

In [27]:
df1 = pd.DataFrame({
    'Item': ['A', 'B', 'C'],
    'Price': [10, 20, 30]
})

df2 = pd.DataFrame({
    'Item': ['D', 'E', 'F'],
    'Price': [40, 50, 60]
})

df3 = pd.DataFrame({
    'Country': ['X', 'Y', 'Z'],
    'Available': [True, False, True]
})

df4 = pd.DataFrame({
    'Item': ['B', 'C', 'D'],
    'Country': ['X', 'Y', 'Z']
})

df5 = pd.DataFrame({
    'Price': [10, 20, 30]
}, index=['A', 'B', 'C'])

df6 = pd.DataFrame({
    'Country': ['X', 'Y', 'Z']
}, index=['B', 'C', 'D'])

In [12]:
# Concatenating Data Frames
pd.concat([df1, df2])

  Item  Price
0    A     10
1    B     20
2    C     30
0    D     40
1    E     50
2    F     60

In [13]:
pd.concat([df1, df3], axis=1) # you can also concatenate data frames with different types of data

  Item  Price Country  Available
0    A     10       X       True
1    B     20       Y      False
2    C     30       Z       True

In [ ]:
# Merging Data Frames
pd.merge(df1, df4) # this will merge what the data frames have in common

  Item  Price Country
0    B     20       X
1    C     30       Y

In [ ]:
pd.merge(df1, df4, how='outer') # by specifying a how parameter, depending on what the how parameter is, it will show you the other empty rows
                                # 'outer' will show everything

  Item  Price Country
0    A   10.0     NaN
1    B   20.0       X
2    C   30.0       Y
3    D    NaN       Z

In [ ]:
pd.merge(df1, df4, how='inner') # 'inner' will show the normal merging

  Item  Price Country
0    B     20       X
1    C     30       Y

In [20]:
pd.merge(df1, df4, how='left') # 'left' will keep everything from the first data frame, but not from the second

  Item  Price Country
0    A     10     NaN
1    B     20       X
2    C     30       Y

In [ ]:
pd.merge(df1, df4, how='right') # 'right' will keep everything from the second data frame, but not from the first

  Item  Price Country
0    B   20.0       X
1    C   30.0       Y
2    D    NaN       Z

In [26]:
pd.merge(df1, df4, on='Item', how='outer') # 'on=' will specify the column that it will be merged

  Item  Price Country
0    A   10.0     NaN
1    B   20.0       X
2    C   30.0       Y
3    D    NaN       Z

In [31]:
# Joining Data Frames
df5.join(df6) # this will join them by the index, and it's not a pandas method, but a data frame method

   Price Country
A     10     NaN
B     20       X
C     30       Y